{
  "logo": {
    "name": "Денис Каразан"
  },
  "menu": {
    "main": "Главная",
    "about": "Обо мне",
    "skills": "Навыки",
    "projects": "Проекты",
    "contacts": "Контакты"
  },
  "intro": {
    "spec": "разработчик",
    "title": "Привет, меня зовут Денис Каразан",
    "description_1": "Разрабатываю сайты и веб-приложения с нуля. ",
    "description_2": "Имею опыт управления командой и работы в команде. ",
    "description_3": "Постоянно развиваюсь в сфере веб-разработки.",
    "button_cv": "Скачать CV"
  },
  "experience": {
    "title": "Опыт",
    "job": {
      "company_1": "ОАО “Гомельдрев”",
      "position_1": "Инженер электроник",
      "date_1": "Август 2016 - Август 2019, Речица",
      "more_info_1": "Диагностика, анализ, ремонт и обслуживание промышленной электроники. Обеспечение бесперебойной работы автоматизированных производственных линий. Диагностика программ контроллера ПЛК Siemens. Чтение и создание электрических схем. Управление параметрами сложного промышленного оборудования (расходомеры, преобразователи давления, преобразователи частоты и т.п.)",
      "company_2": "СООО “Ингман Мороженное”",
      "position_2": "Инженер электроник",
      "date_2": "Август 2019 - Декабрь 2021, Гомель",
      "more_info_2": "Техническое обслуживание, ремонт и устранение неисправностей линии по производству мороженого. Контроль параметров, настройка электронных компонентов и блоков оборудования, проведение тестовых проверок. Обеспечение правильной и бесперебойной работы промышленных принтеров Domino",
      "company_3": "Brymonsoft",
      "position_3": "Front-end Разработчик",
      "date_3": "Декабрь 2021 - Январь 2023, Гомель",
      "more_info_3": "Поддержка и рефакторинг CRM. Создание новых макетов для редизайна сайта. Разработка отдельной страницы «Расходы» с аналитикой для CRM. Эффективная очистка бэклога для сторонней компании. Работа с интерактивной картой Mapbox. Поддержка и разработка виджетов и компонентов для конструктора сайтов. Встраивание виджетов на сайты клиентов. Поддержание CRM для администрирования конструктора веб-сайтов и создание мобильной версии CRM для беспрепятственного пост-администрирования (похоже на Tinder)",
      "company_4": "Big Data Technologies",
      "position_4": "FullStack Разработчик",
      "date_4": "Февраль 2023 - Март 2025, Удаленно",
      "more_info_4": "Работа с расширением браузера и виджетами интерфейса. Создание новых микросервисов. Разработка функций мониторинга продуктов и оптимизация запросов в MongoDB. Я активно искал и внедрял решения для повышения устойчивости системы. Построение информационных панелей Grafana с помощью процессов ETL. Оптимизация сборки за счет сокращения ненужного кода и замены изображений. Обновление проектов (библиотеки, Webpack, Node.js, React, манифест). Уменьшение расходов. Сбор метрики с помощью Prometheus. Участие в написании документации и тестировании",
      "company_5": "cityOS",
      "position_5": "Front-end Разработчик",
      "date_5": "Сентрябрь 2024 - Настоящие время, Удаленно",
      "more_info_5": "Разработал с нуля и довёл до сдачи один проект. В четырёх существующих проектах существенно улучшаю функциональность и добавляю новые возможности. Занимаюсь веб- и мобильной разработкой (React, React Native), реализую авторизацию, управление пользователями, контроллерами и локациями, интеграцию RTSP и диплинки. Настраиваю CI/CD автодеплоя фронтенда. Реализую и публикую мобильные приложения в App Store и Google Play. Оптимизирую интерфейсы с использованием Ant Design, исправляю баги и повышаю стабильность продуктов. Участвую в проектировании архитектуры и выборе технологий. Разрабатываю модули для работы с низкоуровневыми контроллерами и различными промышленными протоколами (Modbus, Wiegand и др.), обеспечивая интеграцию сложных систем."
    }
  },
  "projects": {
    "title": "Проекты",
    "project": {
      "description_1": "Создание всего лендинга и логики сайта",
      "description_2": "Работа с TypeScript и создание всего приложения",
      "description_3": "Создание бэкенда, работа с CRUD и создание всего приложения",
      "description_4": "Итоговый учебный проект, командная работа и работа с вебсокетами",
      "description_5": "Работа с картой и данными на ней и устранение неполадок",
      "description_6": "Создание страницы затрат и графиков затрат",
      "description_7": "Создание виджета для конструктора сайтов и работа с админкой CRM",
      "description_8": "Работа с расширением для браузера, сопровождение и создание микросервисов",
      "description_9": "Разработка интерфейса для управления технологиями умного дома для гостиничных номеров посредствам контроллера",
      "description_10": "Разработка и поддержка веб-интерфейс для управления контроллером и его настройки. Работа с сущностями контроллера, алгоритмами и настройками",
      "description_11": "Разработка веб-сайта с админ панелью. Подключение и настройка TimeTable",
      "description_12": "Разработка модулей авторизации, прав, жильцов и сотрудников. Настройка Ant Design",
      "description_13": "Разработка веб-интерфейса для облачной настройки приложения умного дома",
      "description_14": "Разработка мобильного приложения для умного дома посредством контроллера",
      "button_view": "Посмотреть",
      "button_stack": "Тех стек"
    },
    "modal": {
      "tech": "Тех стек: ",
      "nda": "Проект под NDA"
    }
  },
  "skills": {
    "title": "Навыки"
  },
  "interests": {
    "title": "Интересы",
    "interest": {
      "films": "Фильмы",
      "music": "Музыка",
      "games": "Игры",
      "cars": "Автомобили",
      "electronics": "Электроника",
      "books": "Книги",
      "travel": "Путешествие",
      "self_study": "Обучение"
    }
  },
  "education": {
    "title": "Образование",
    "certificate": {
      "sert_name_1": "Высшее образование",
      "course_1": "Факультет Автоматизированных и Информационных Систем",
      "date_1": "Сентябрь 2011 - Июнь 2016",
      "more_info_1": "ГГТУ имени Павла Сухого. Специалист / Инженер по радиоэлектронике",
      "sert_name_2": "JavaScript/Front-end",
      "course_2": "The Rolling Scopes School",
      "date_2": "Декабрь 2020 - Июль 2021",
      "sert_name_3": "React",
      "course_3": "The Rolling Scopes School",
      "date_3": "Июль 2021 - Окрябрь 2021",
      "sert_name_4": "Angular",
      "course_4": "The Rolling Scopes School",
      "date_4": "Март 2022 - Май 2022",
      "sert_name_5": "Общий курс английского языка",
      "course_5": "Streamline",
      "date_5": "Январь 2022 - Июнь 2022",
      "sert_name_6": "NodeJS",
      "course_6": "The Rolling Scopes School",
      "date_6": "Май 2022 - Август 2022",
      "sert_name_7": "Основы AWS",
      "course_7": "The Rolling Scopes School",
      "date_7": "Март 2023 - Апрель 2023"
    }
  },
  "contacts": {
    "title": "Контакты",
    "form": {
      "name": "Имя",
      "email": "Почта",
      "message": "Сообщение",
      "button_send": "Отправить"
    },
    "success_text": "Ваше сообщение было успешно отправлено! Я отвечу вам в ближайшее время",
    "failure_text": "Что-то пошло не так. Используйте контакты ниже, чтобы связаться со мной"
  },
  "footer": {
    "priority": "Прежде чем сотрудничать, важно понимать, что я, как опытный веб-разработчик, не могу выполнять “срочные задачи” или участвовать в проектах продолжительностью менее одного дня. Я сосредоточен на развитии прочных партнерских отношений, а не на стремлении к быстрой и краткосрочной выгоде"
  },
  "about": {
    "title": "Обо мне",
    "description": "Я честный и ответственный человек. Хорошо лажу с людьми. Отношусь к своей работе с максимальной эффективностью. Я занимаюсь саморазвитием. Моя первая встреча с JavaScript состоялась в июне 2020 года. Для меня технология — это инструмент",
    "alt_text_photo": "Это я"
  },
  "input": {
    "required": "требуется!",
    "max_length": "Превышена макс длина"
  }
}