{
  "logo": {
    "name": "Denis Karazan"
  },
  "menu": {
    "main": "Main",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contacts": "Contacts"
  },
  "intro": {
    "spec": "developer",
    "title": "Hello, my name is Denis Karazan",
    "description_1": "I can develop websites and web applications from scratch. ",
    "description_2": "I have experience managing a team and working as a team. ",
    "description_3": "I'm constantly developing in the field of web development.",
    "button_cv": "Download CV"
  },
  "experience": {
    "title": "Experience",
    "job": {
      "company_1": "Big Data Technologies",
      "position_1": "FullStack Developer",
      "date_1": "February 2023 - Present time, Remote",
      "more_info_1": "Working with the browser extension and frontend widgets. Creating new microservices. Developing features for monitoring products, and optimizing queries in MongoDB. I actively sought and implemented solutions to enhance system resilience. Constructed Grafana dashboards through ETL processes. Optimized builds by reducing unnecessary code and replacing images. Updating projects (libraries, Webpack, Node.js, React, manifest). Reducing costs. Gathered metrics using Prometheus. And contributed to documentation and testing",
      "company_2": "Brymonsoft",
      "position_2": "Front-end Developer",
      "date_2": "December 2021 - January 2023, Gomel",
      "more_info_2": "CRM support and refactoring. Creating new layouts for website redesign. Developing a dedicated “Expenses” page with analytics for CRM. Efficient backlog cleanup for an external company. Working with the Mapbox interactive map. Supporting and developing widgets and components for a website builder. Embedding widgets on client websites. Maintaining CRM for website builder administration, and creating a mobile version of CRM for seamless post administration (similar to Tinder)",
      "company_3": "JLLC “Ingman Ice cream”",
      "position_3": "Electronic Engineer",
      "date_3": "August 2019 - December 2021, Gomel",
      "more_info_3": "Technical maintenance, repair, and troubleshooting of the ice cream production line. Monitoring parameters, adjusting electronic components and equipment blocks, conducting test checks. Ensuring proper and uninterrupted operation of industrial Domino printers",
      "company_4": "JSC “Gomeldrev”",
      "position_4": "Electronic Engineer",
      "date_4": "August 2016 - August 2019, Rechytsa",
      "more_info_4": "Diagnosing, analyzing, repairing, and servicing industrial electronics. Ensuring uninterrupted operation of automated production lines. Diagnosing PLC Siemens controller programs. Reading and creating electrical schematics. Managing parameters of complex industrial equipment (flow meters, pressure transducers, frequency converters, etc.)"
    }
  },
  "projects": {
    "title": "Projects",
    "project": {
      "description_1": "Working with the browser extension, maintaining and creating microservices",
      "description_2": "Creating a widget for the site-builder and working with admin CRM",
      "description_3": "Creating a page of costs and schedules for costs",
      "description_4": "Working with the map and data on it and troubleshooting",
      "description_5": "Final training project, teamwork and work with websockets",
      "description_6": "Creating a backend, working with CRUD and creating the entire application",
      "description_7": "Working with TypeScript and creating the entire application",
      "description_8": "Creation of the entire landing page and site logic",
      "button_view": "View Project",
      "button_stack": "Tech stack"
    },
    "modal": {
      "prev_text": "Tech stack: "
    }
  },
  "skills": {
    "title": "Skills"
  },
  "interests": {
    "title": "Interests",
    "interest": {
      "films": "Films",
      "music": "Music",
      "games": "Games",
      "cars": "Cars",
      "electronics": "Electronics",
      "books": "Books",
      "travel": "Travel",
      "self_study": "Self study"
    }
  },
  "education": {
    "title": "Education",
    "certificate": {
      "sert_name_1": "Higher education",
      "course_1": "Faculty of Automated and Information Technologies",
      "date_1": "September 2011 - June 2016",
      "more_info_1": "GSTU named after Pavel Sukhoi. Specialist / Engineer in radio electronics",
      "sert_name_2": "JavaScript/Front-end",
      "course_2": "The Rolling Scopes School",
      "date_2": "December 2020 - July 2021",
      "sert_name_3": "React",
      "course_3": "The Rolling Scopes School",
      "date_3": "July 2021 - October 2021",
      "sert_name_4": "Angular",
      "course_4": "The Rolling Scopes School",
      "date_4": "March 2022 - May 2022",
      "sert_name_5": "General English Course",
      "course_5": "Streamline",
      "date_5": "January 2022 - June 2022",
      "sert_name_6": "NodeJS",
      "course_6": "The Rolling Scopes School",
      "date_6": "May 2022 - August 2022",
      "sert_name_7": "AWS Fundamentals",
      "course_7": "The Rolling Scopes School",
      "date_7": "March 2023 - April 2023"
    }
  },
  "contacts": {
    "title": "Contacts",
    "form": {
      "name": "Name",
      "email": "Email",
      "message": "Message",
      "button_send": "Send"
    }
  },
  "footer": {
    "priority": "Prior to collaboration, it's essential to acknowledge that, as a seasoned web developer, I'm unable to accommodate “urgent tasks” or engage in projects of a duration shorter than a day. My focus is on cultivating enduring partnerships rather than pursuing quick, short-term gains"
  },
  "about": {
    "title": "About me",
    "description": "I'm an honest and responsible person. I get along well with people. I treat my work with maximum efficiency. I'm engaged in self-study. My first encounter with JavaScript was in June 2020. For me, technology is a tool",
    "alt_text_photo": "it's my"
  }
}